Repository: AChep/keyguard-app
Catalog: appleUi/Sources/KeyguardUI/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hu, it, ja, ko, pt_br, pt_pt, ru, uk, zh_hans

# ssh_agent_setup_android_termux_text
source: On Android, Keyguard provides the SSH agent via a dedicated helper package. Enable SSH agent in Keyguard, install and configure the package, and approve requests when your SSH client connects.
ar: على Android، يوفّر Keyguard وكيل SSH عبر حزمة مساعدة مخصّصة. فعّل وكيل SSH في Keyguard، وثبّت الحزمة وأعدّها، ووافق على الطلبات عند اتصال عميل SSH لديك.
de: Auf Android stellt Keyguard den SSH-Agenten über ein spezielles Hilfspaket bereit. Aktivieren Sie den SSH-Agenten in Keyguard, installieren und konfigurieren Sie das Paket und genehmigen Sie Anfragen, sobald Ihr SSH-Client eine Verbindung herstellt.
es: En Android, Keyguard proporciona el agente SSH a través de un paquete de ayuda dedicado. Active el agente SSH en Keyguard, instale y configure el paquete, y apruebe las peticiones cuando su cliente SSH se conecte.
fr: Sur Android, Keyguard fournit l'agent SSH via un paquet d'aide dédié. Activez l'agent SSH dans Keyguard, installez et configurez le paquet, et approuvez les requêtes lorsque votre client SSH se connecte.
hu: Androidon a Keyguard az SSH ügynököt egy dedikált segédcsomagon keresztül biztosítja. Engedélyezze az SSH ügynököt a Keyguardban, telepítse és konfigurálja a csomagot, majd hagyja jóvá a kéréseket, amikor az SSH kliens csatlakozik.
ko: Android에서는 Keyguard가 추가 패키지를 통해 SSH 에이전트를 사용합니다. Keyguard에서 SSH 에이전트를 켠 뒤 추가 패키지를 설치하고 설정한 다음, SSH 클라이언트를 연결할 때 요청을 승인하세요.
pt_br: No Android, o Keyguard fornece o agente SSH por meio de um pacote auxiliar dedicado. Habilite o agente SSH no Keyguard, instale e configure o pacote e aprove solicitações quando seu cliente SSH se conectar.
pt_pt: No Android, o Keyguard fornece o agente SSH através de um pacote auxiliar dedicado. Active o agente SSH no Keyguard, instale e configure o pacote e aprove os pedidos quando o seu cliente SSH se ligar.
uk: На Android Keyguard забезпечує роботу SSH-агента за допомогою спеціального допоміжного пакета. Увімкніть SSH-агента в Keyguard, встановіть та налаштуйте пакет, а потім схвалюйте запити під час підключення вашого SSH-клієнта.
zh_hans: 在 Android 上，Keyguard 通过专用辅助软件包提供 SSH 代理。请在 Keyguard 中启用 SSH 代理，安装并配置该软件包，并在 SSH 客户端连接时批准请求。

# ssh_agent_setup_header_title
source: SSH client setup
ar: إعداد عميل SSH
de: SSH-Client-Konfiguration
es: Configuración del cliente SSH
fr: Configuration du client SSH
hu: SSH kliens beállítása
it: Configurazione client SSH
ja: SSHクライアントのセットアップ
ko: SSH 클라이언트 설정
pt_br: Configuração do cliente SSH
pt_pt: Configuração do cliente SSH
ru: Настройка SSH-клиента
uk: Налаштування SSH клієнта
zh_hans: SSH 客户端设置

# ssh_agent_setup_intro
source: Setup an SSH client to connect to Keyguard's SSH agent to let it perform authentication or signing with your approved keys without exposing private key material.
ar: قم بإعداد عميل SSH للاتصال بوكيل SSH الخاص بـ Keyguard للسماح له بإجراء المصادقة أو التوقيع باستخدام مفاتيحك المعتمدة دون كشف بيانات المفتاح الخاص.
de: Richten Sie einen SSH-Client ein, um sich mit dem SSH-Agenten von Keyguard zu verbinden, damit dieser sich mit Ihren genehmigten Schlüsseln authentifizieren oder Daten signieren kann, ohne privates Schlüsselmaterial offenzulegen.
es: Configure un cliente SSH para conectarse al agente SSH de Keyguard, lo que le permitirá realizar autenticaciones o firmas con sus claves aprobadas sin exponer material de clave privada.
fr: Configurez un client SSH pour vous connecter à l'agent SSH de Keyguard afin de lui permettre d'effectuer l'authentification ou la signature avec vos clés approuvées sans exposer de matériel de clé privée.
hu: Állítson be egy SSH klienst, hogy csatlakozzon a Keyguard SSH ügynökéhez, és lehetővé tegye a hitelesítést vagy az aláírást a jóváhagyott kulcsokkal anélkül, hogy felfedné a privát kulcsot.
it: Configura un client SSH per la connessione all'agente SSH di Keyguard in modo da consentirgli di eseguire l'autenticazione o la firma con le tue chiavi approvate senza esporre il materiale chiave privato.
ja: SSHクライアントをKeyguardのSSHエージェントに接続して設定すると、秘密鍵の情報を外部に公開することなく、承認済みキーで認証や署名を行うことができます。
ko: SSH 클라이언트에서 Keyguard의 SSH 에이전트에 연결할 수 있게 설정합니다. 개인 키를 노출시키지 않고 로그인 또는 인증이 가능합니다.
pt_br: Configure um cliente SSH para se conectar ao agente SSH do Keyguard para permitir que ele execute autenticação ou assinatura com suas chaves aprovadas sem expor o material da chave privada.
pt_pt: Configure um cliente SSH para se ligar ao agente SSH do Keyguard, permitindo-lhe executar a autenticação ou a assinatura com as suas chaves aprovadas sem expor o material da chave privada.
ru: Настройте SSH-клиент для подключения к SSH-агенту Keyguard, чтобы он мог выполнять аутентификацию или подписание вашими одобренными ключами без раскрытия материалов закрытого ключа.
uk: Налаштуйте SSH-клієнт для підключення до SSH-агента Keyguard, щоб він міг виконувати автентифікацію або підписування вашими затвердженими ключами без розкриття даних закритого ключа.
zh_hans: 配置 SSH 客户端以连接至 Keyguard 的 SSH 代理，使其能使用您授权的密钥进行身份验证或签名操作，且不会暴露私钥材料。

# ssh_agent_setup_linux_socket_fallback_note
source: Fallback path: use this when XDG_RUNTIME_DIR is unavailable in your session.
ar: مسار بديل: استخدم هذا عندما لا يكون XDG_RUNTIME_DIR متاحًا في جلستك.
de: Alternativer Pfad: Verwenden Sie diesen, wenn XDG_RUNTIME_DIR in Ihrer Sitzung nicht verfügbar ist.
es: Ruta alternativa: use esto cuando XDG_RUNTIME_DIR no esté disponible en su sesión.
fr: Chemin de secours : utilisez-le lorsque XDG_RUNTIME_DIR n'est pas disponible dans votre session.
hu: Tartalék útvonal: használja ezt, ha az XDG_RUNTIME_DIR nem érhető el a munkamenetben.
it: Percorso di ripiego: da utilizzare quando XDG_RUNTIME_DIR non è disponibile nella sessione.
ja: 代替パス: セッションでXDG_RUNTIME_DIRが利用できない場合に使用してください。
ko: 대체 경로: 세션에서 XDG_RUNTIME_DIR을 사용할 수 없는 경우 사용하세요.
pt_br: Caminho alternativo: use quando XDG_RUNTIME_DIR não estiver disponível em sua sessão.
pt_pt: Caminho alternativo: utilize este caminho quando XDG_RUNTIME_DIR não está disponível na sua sessão.
ru: Запасной путь: используйте его, если переменная XDG_RUNTIME_DIR недоступна в вашей сессии.
uk: Резервний шлях: використовуйте це, коли XDG_RUNTIME_DIR недоступний у вашому сеансі.
zh_hans: 备用路径：当您的会话中 XDG_RUNTIME_DIR 不可用时，请使用此路径。

# ssh_agent_setup_option_env_label
source: Set SSH_AUTH_SOCK to Keyguard's socket path.
ar: قم بتعيين SSH_AUTH_SOCK إلى مسار مقبس Keyguard.
de: Setzen Sie SSH_AUTH_SOCK auf den Socket-Pfad von Keyguard.
es: Establezca SSH_AUTH_SOCK a la ruta del socket de Keyguard.
fr: Définissez SSH_AUTH_SOCK sur le chemin du socket de Keyguard.
hu: Állítsa be az SSH_AUTH_SOCK-ot a Keyguard socket útvonalára.
it: Imposta SSH_AUTH_SOCK sul percorso del socket di Keyguard.
ja: SSH_AUTH_SOCKをKeyguardのソケットパスに設定します。
ko: SSH_AUTH_SOCK을 Keyguard의 소켓 경로로 설정하세요.
pt_br: Defina SSH_AUTH_SOCK para o caminho do socket do Keyguard.
pt_pt: Defina SSH_AUTH_SOCK para o caminho' do socket do Keyguard.
ru: Установите SSH_AUTH_SOCK на путь к сокету Keyguard.
uk: Встановіть SSH_AUTH_SOCK на шлях до сокета Keyguard.
zh_hans: 将 SSH_AUTH_SOCK 设置为 Keyguard 的套接字路径。

# ssh_agent_setup_option_env_tab
source: Env
ar: البيئة
es: Entorno
hu: Környezet
it: Ambiente
ja: 環境変数
ko: 환경변수
uk: Середовище
zh_hans: 环境变量

# ssh_agent_setup_option_identityagent_label
source: Set IdentityAgent in your SSH config.
ar: قم بتعيين IdentityAgent في تكوين SSH الخاص بك.
de: Setzen Sie IdentityAgent in Ihrer SSH-Konfiguration.
es: Establezca IdentityAgent en su configuración de SSH.
fr: Définissez IdentityAgent dans votre configuration SSH.
hu: Állítsa be az IdentityAgent-et az SSH konfigurációjában.
it: Imposta IdentityAgent nella tua configurazione SSH.
ja: SSH設定ファイルでIdentityAgentを設定します。
ko: SSH 구성에서 IdentityAgent를 설정하세요.
pt_br: Defina o IdentityAgent na sua configuração SSH.
pt_pt: Configure o agente de identidade no seu ficheiro de configuração SSH.
ru: Установите IdentityAgent в вашей конфигурации SSH.
uk: Встановіть IdentityAgent у вашій конфігурації SSH.
zh_hans: 在您的 SSH 配置文件中设置 IdentityAgent。

# ssh_agent_setup_option_identityagent_tab
source: Config
ar: التكوين
de: Konfiguration
es: Configuración
fr: Réglages
hu: Konfiguráció
it: Configurazione
ja: 設定ファイル
ko: 구성
uk: Конфігурація
zh_hans: 配置

# ssh_agent_setup_step_1_text
source: Open Developer settings and enable SSH agent.
ar: افتح إعدادات الأمان وفعل وكيل SSH.
de: Öffnen Sie die Sicherheitseinstellungen und aktivieren Sie den SSH-Agenten.
es: Abra la configuración de seguridad y habilite el agente SSH.
fr: Ouvrez les paramètres de sécurité et activez l'agent SSH.
hu: Nyissa meg a Biztonsági beállításokat, és engedélyezze az SSH ügynököt.
it: Apri le Impostazioni di sicurezza e abilita l'Agente SSH.
ja: セキュリティ設定を開き、SSHエージェントを有効にします。
ko: 보안 설정을 열어 SSH 에이전트 옵션을 켭니다.
pt_br: Abra as configurações de segurança e habilite o agente SSH.
pt_pt: Abra as configurações de segurança e ative o agente SSH.
ru: Откройте настройки безопасности и включите SSH-агент.
uk: Відкрийте налаштування безпеки та увімкніть SSH-агент.
zh_hans: 打开安全设置并启用 SSH 代理。

# ssh_agent_setup_step_1_title
source: 1. Enable SSH agent in Keyguard
ar: 1. تفعيل وكيل SSH في Keyguard
de: 1. SSH-Agenten in Keyguard aktivieren
es: 1. Habilitar el agente SSH en Keyguard
fr: 1. Activer l'agent SSH dans Keyguard
hu: 1. SSH ügynök engedélyezése a Keyguardban
it: 1. Abilita l'agente SSH su Keyguard
ja: 1. KeyguardでSSHエージェントを有効化
ko: 1. Keyguard에서 SSH 에이전트 켜기
pt_br: 1. Habilite o agente SSH no Keyguard
pt_pt: 1. Ativar o agente SSH no Keyguard
ru: 1. Включите SSH-агент в Keyguard
uk: 1. Увімкніть SSH-агент у Keyguard
zh_hans: 1. 在 Keyguard 中启用 SSH 代理

# ssh_agent_setup_step_2_text
source: Point your SSH client at Keyguard's socket path.
ar: وجّه عميل SSH الخاص بك إلى مسار مقبس Keyguard.
de: Verweisen Sie Ihren SSH-Client auf den Socket-Pfad von Keyguard.
es: Apunte su cliente SSH a la ruta del socket de Keyguard.
fr: Pointez votre client SSH vers le chemin de socket de Keyguard.
hu: Irányítsa az SSH klienst a Keyguard socket útvonalára.
it: Indirizza il tuo client SSH al percorso del socket di Keyguard.
ja: SSHクライアントにKeyguardのソケットパスを指定します。
ko: SSH 클라이언트에 Keyguard의 소켓 경로를 지정합니다.
pt_br: Aponte seu cliente SSH para o caminho do socket do Keyguard.
pt_pt: Configure o seu cliente SSH para utilizar o caminho do socket do Keyguard.
ru: Укажите вашему SSH-клиенту путь к сокету Keyguard.
uk: Вкажіть вашому SSH-клієнту шлях до сокета Keyguard.
zh_hans: 将您的 SSH 客户端指向 Keyguard 的套接字路径。

# ssh_agent_setup_step_2_title
source: 2. Configure your SSH client
ar: 2. تكوين عميل SSH الخاص بك
de: 2. Konfigurieren Sie Ihren SSH-Client
es: 2. Configurar su cliente SSH
fr: 2. Configurer votre client SSH
hu: 2. Konfigurálja az SSH klienst
it: 2. Configura il tuo client SSH
ja: 2. SSHクライアントの設定
ko: 2. SSH 클라이언트 설정
pt_br: 2. Configure seu cliente SSH
pt_pt: 2. Configure o seu cliente SSH
ru: 2. Настройте ваш SSH-клиент
uk: 2. Налаштуйте ваш SSH-клієнт
zh_hans: 2. 配置您的 SSH 客户端

# ssh_agent_setup_step_3_text
source: Run these commands in the same shell session where you configured the agent.
ar: شغّل هذه الأوامر في نفس جلسة الغلاف (shell session) حيث قمت بتكوين الوكيل.
de: Führen Sie diese Befehle in derselben Shell-Sitzung aus, in der Sie den Agenten konfiguriert haben.
es: Ejecute estos comandos en la misma sesión de terminal donde configuró el agente.
fr: Exécutez ces commandes dans la même session de terminal où vous avez configuré l'agent.
hu: Futtassa ezeket a parancsokat ugyanabban a shell munkamenetben, ahol az ügynököt konfigurálta.
it: Esegui questi comandi nella stessa sessione di shell su cui è stato configurato l'agente.
ja: エージェントを設定したのと同じシェルセッションで、以下のコマンドを実行します。
ko: 에이전트를 설정한 세션과 같은 세션에서 다음 명령어를 실행하세요.
pt_br: Execute esses comandos na mesma sessão de shell em que você configurou o agente.
pt_pt: Execute estes comandos na mesma sessão de shell em que configurou o agente.
ru: Выполните эти команды в той же сессии оболочки (shell), в которой вы настраивали агент.
uk: Виконайте ці команди в тому самому сеансі командної оболонки, у якому налаштували агента.
zh_hans: 在配置了代理的同一 Shell 会话中运行这些命令。

# ssh_agent_setup_step_3_title
source: 3. Verify
ar: 3. التحقق
de: 3. Überprüfen
es: 3. Verificar
fr: 3. Vérifier
hu: 3. Ellenőrzés
it: 3. Verifica
ja: 3. 確認
ko: 3. 확인
pt_br: 3. Verifique
pt_pt: 3. Verificar
ru: 3. Проверка
uk: 3. Перевірка
zh_hans: 3. 验证

# ssh_agent_setup_windows_text
source: Keyguard listens on a Windows named pipe. Point Windows OpenSSH at this pipe.
ar: لا يتوفر بيئة عمل وكيل SSH الخاصة بـ Keyguard المكتبي حاليًا على نظام Windows، لذا الإعداد هنا للعلم فقط.
de: Die aktuelle Desktop-SSH-Agent-Laufzeitumgebung von Keyguard ist vorerst nicht unter Windows verfügbar, daher dienen die Einrichtungsschritte hier nur zu Informationszwecken.
es: El entorno de ejecución del agente SSH de Keyguard para escritorio aún no está disponible en Windows, por lo que la configuración aquí es solo informativa.
fr: L'exécution actuelle de l'agent SSH pour Keyguard sur ordinateur n'est pas encore disponible sur Windows. Ces instructions sont donc fournies à titre indicatif uniquement.
hu: A jelenlegi Keyguard asztali SSH ügynök futtatókörnyezet még nem érhető el Windowson, ezért ez a beállítás csak tájékoztató jellegű.
it: L'attuale runtime dell'agente SSH per la versione desktop di Keyguard non è ancora disponibile su Windows, quindi la configurazione indicata qui è solo a titolo informativo.
ja: 現在、デスクトップ版KeyguardのSSHエージェントはWindowsでは利用できません。以下のセットアップ手順は参考用です。
ko: Windows에서는 현재 Keyguard 데스크톱 SSH 에이전트 런타임을 사용할 수 없습니다.
pt_br: O tempo de execução atual do agente SSH do desktop Keyguard ainda não está disponível no Windows, portanto, a configuração aqui é apenas informativa.
pt_pt: O ambiente de execução atual do agente SSH para ambiente de trabalho do Keyguard ainda não está disponível para Windows, pelo que a configuração aqui apresentada é apenas para fins informativos.
ru: Текущая версия SSH-агента Keyguard для ПК пока недоступна в Windows, поэтому информация по настройке здесь носит исключительно ознакомительный характер.
uk: SSH-агент поки що недоступний для Windows, тому налаштування тут наведені лише для ознайомлення.
zh_hans: 当前的 Keyguard 桌面 SSH 代理运行时暂不支持 Windows，因此此处的设置说明仅供参考。

source: SSH client
ar: عميل SSH
es: Cliente SSH
fr: Client SSH
hu: SSH kliens
it: Client SSH
ja: SSH クライアント
ko: SSH 클라이언트
pt_br: Cliente SSH
pt_pt: Cliente SSH
ru: SSH-клиент
uk: SSH клієнт
zh_hans: SSH 客户端

source: SSH client request
ar: طلب عميل SSH
de: SSH-Client-Anfrage
es: Solicitud del cliente SSH
fr: Requête du client SSH
hu: SSH kliens kérés
it: Richiesta del client SSH
ja: SSHクライアントリクエスト
ko: SSH 클라이언트 요청
pt_br: Solicitação de cliente SSH
pt_pt: Pedido do cliente SSH
ru: Запрос от SSH-клиента
uk: Запит від SSH клієнта
zh_hans: SSH 客户端请求

# ssh_key_action_add_key_title
source: Add keys
ar: إضافة مفاتيح
de: Schlüssel hinzufügen
es: Añadir claves
fr: Ajouter des clés
hu: Kulcsok hozzáadása
it: Aggiungi chiavi
ja: キーを追加
ko: 키 추가
pt_br: Adicionar chaves
pt_pt: Adicionar chaves
ru: Добавить ключи
uk: Додати ключі
zh_hans: 添加密钥

# ssh_key_action_replace_key_title
source: Replace keys
ar: استبدال المفاتيح
de: Schlüssel ersetzen
es: Reemplazar claves
fr: Remplacer les clés
hu: Kulcsok cseréje
it: Sostituisci chiavi
ja: キーを置換
ko: 키 교체
pt_br: Substituir chaves
pt_pt: Substituir chaves
ru: Заменить ключи
uk: Замінити ключі
zh_hans: 替换密钥

# ssh_key_action_save_public_key_saved_downloads_success_title
source: Public key saved to Downloads
ar: تم حفظ المفتاح العام في التنزيلات
de: Öffentlicher Schlüssel in Downloads gespeichert
es: Clave pública guardada en Descargas
fr: Clé publique enregistrée dans les téléchargements
hu: Nyilvános kulcs mentve a letöltések közé
it: Chiave pubblica salvata nei Download
ja: ダウンロードに公開鍵を保存しました
ko: 공개 키를 다운로드 폴더에 저장했습니다.
pt_br: Chave pública salva nos Downloads
pt_pt: Chave pública guardada nas transferências
ru: Открытый ключ сохранен в папку Загрузки
uk: Відкритий ключ збережено в теку Завантаження
zh_hans: 保存公钥到下载

# ssh_key_action_save_public_key_title
source: Save public key
ar: حفظ المفتاح العام
de: Öffentlicher Schlüssel speichern
es: Guardar clave pública
fr: Enregistrer la clé publique
hu: Nyilvános kulcs mentése
it: Salva chiave pubblica
ja: 公開鍵を保存
ko: 공개 키 저장
pt_br: Salvar chave pública
pt_pt: Guardar chave pública
ru: Сохранить открытый ключ
uk: Зберегти відкритий ключ
zh_hans: 保存公钥

# ssh_key_action_save_unencrypted_keys_saved_downloads_success_title
source: Keys saved to Downloads
ar: تم حفظ المفاتيح في التنزيلات
de: Schlüssel in Downloads gespeichert
es: Claves guardadas en Descargas
fr: Clés enregistrées dans les téléchargements
hu: A kulcsok a letöltésekbe lettek mentve
it: Chiavi salvate nei Download
ja: キーはダウンロードに保存されました
ko: 키를 다운로드 폴더에 저장했습니다.
pt_br: Chaves guardadas nos Downloads
pt_pt: Chaves guardadas nas transferências
ru: Ключи сохранены в папку Загрузки
uk: Ключі збережено в теку Завантаження
zh_hans: 保存密钥到下载

# ssh_key_action_save_unencrypted_keys_title
source: Save unencrypted keys
ar: حفظ المفاتيح غير المشفرة
de: Unverschlüsselte Schlüssel speichern
es: Guardar claves sin cifrar
fr: Enregistrer les clés non chiffrées
hu: Titkosítatlan kulcsok mentése
it: Salva chiavi non crittografate
ja: 暗号化されていないキーを保存
ko: 암호화되지 않은 키 저장
pt_br: Salvar chaves não criptografadas
pt_pt: Guardar chaves desencriptadas
ru: Сохранить незашифрованные ключи
uk: Зберегти незашифровані ключі
zh_hans: 保存未加密的密钥

# ssh_key_action_save_unencrypted_private_key_saved_downloads_success_title
source: Unencrypted private key saved to Downloads
ar: مفتاح خاص غير مشفر تم حفظه في التنزيلات
de: Unverschlüsselter privater Schlüssel in Downloads gespeichert
es: Clave privada sin cifrar guardada en Descargas
fr: Clé privée non chiffrée enregistrée dans les téléchargements
hu: Titkosítatlan privát kulcs mentése a letöltésekbe
it: Chiave privata in chiaro salvata nei download
ja: 暗号化されていない秘密鍵をダウンロードに保存しました
ko: 암호화되지 않은 개인 키를 다운로드 폴더에 저장했습니다.
pt_br: Chave privada não criptografada salva nos Downloads
pt_pt: Chave privada desencriptada guardada nas transferências
ru: Незашифрованный секретный ключ сохранен в Загрузки
uk: Незашифрований секретний ключ збережено в теку Завантаження
zh_hans: 保存未加密私钥到下载

# ssh_key_action_save_unencrypted_private_key_title
source: Save unencrypted private key
ar: حفظ المفتاح الخاص غير المشفر
de: Unverschlüsselter privater Schlüssel speichern
es: Guardar la clave privada sin cifrar
fr: Enregistrer la clé privée non chiffrée
hu: Titkos kulcs mentése titkosítatlanul
it: Salva chiave privata in chiaro
ja: 暗号化されていない秘密鍵を保存
ko: 암호화되지 않은 개인 키 저장
pt_br: Salvar chave privada não criptografada
pt_pt: Guardar chave privada desencriptada
ru: Сохранить незашифрованный секретный ключ
uk: Зберегти незашифрований секретний ключ
zh_hans: 保存未加密的私钥

# ssh_key_import_drop_here
source: Drop a file to import an SSH key
ar: أفلت ملفًا لاستيراد مفتاح SSH
de: Datei hier ablegen, um einen SSH-Schlüssel zu importieren
es: Suelte un archivo para importar una clave de SSH
fr: Déposer un fichier pour importer une clé SSH
hu: Húzzon ide egy fájlt az SSH kulcs importálásához
pt_br: Solte um arquivo para importar uma chave SSH
pt_pt: Arraste e largue um ficheiro para importar uma chave SSH
uk: Перетягніть файл сюди, щоб імпортувати SSH-ключ
zh_hans: 拖放文件以导入 SSH 密钥

# ssh_key_import_error_invalid_passphrase
source: The SSH key passphrase is invalid.
ar: عبارة مرور مفتاح SSH غير صالحة.
de: Die SSH-Schlüssel-Phrase ist ungültig.
es: La contraseña de clave SSH no es válida.
fr: La phrase de passe de la clé SSH est invalide.
hu: Az SSH kulcs jelmondata érvénytelen.
ko: 잘못된 SSH 키 비밀 문구입니다.
pt_br: A senha da chave SSH é inválida.
pt_pt: A frase-palavra-passe da chave SSH é inválida.
uk: Парольна фраза SSH-ключа неправильна.
zh_hans: SSH 密钥口令无效。

# ssh_key_import_error_malformed_key
source: The SSH key file is malformed.
ar: ملف مفتاح SSH مشوّه.
de: Die SSH-Schlüsseldatei ist fehlerhaft.
es: El archivo de clave SSH está mal formado.
fr: Le fichier de clé SSH est mal formé.
hu: Az SSH kulcsfájl hibás.
ko: 잘못된 SSH 키 파일입니다.
pt_br: O arquivo de chave SSH está malformado.
pt_pt: O ficheiro de chave SSH está corrompido.
uk: Файл SSH-ключа пошкоджено.
zh_hans: SSH 密钥文件格式不正确。

# ssh_key_import_error_passphrase_required
source: A passphrase is required to unlock this SSH key.
ar: مطلوب عبارة مرور لفتح مفتاح SSH هذا.
de: Zum Entsperren dieses SSH-Schlüssels ist eine Passphrase erforderlich.
es: Se requiere una contraseña para desbloquear esta clave SSH.
fr: Une phrase de passe est requise pour déverrouiller cette clé SSH.
hu: Egy jelmondat szükséges az SSH kulcs feloldásához.
ko: 이 SSH 키를 잠금 해제하려면 비밀 문구가 필요합니다.
pt_br: Uma senha é necessária para desbloquear esta chave SSH.
pt_pt: É necessária uma frase-palavra-passe para desbloquear esta chave SSH.
uk: Для розблокування цього SSH-ключа потрібна парольна фраза.
zh_hans: 需要口令才能解锁此 SSH 密钥。

# ssh_key_import_error_read
source: Unable to read the selected file.
ar: تعذّرت قراءة الملف المحدد.
de: Die ausgewählte Datei konnte nicht gelesen werden.
es: No es posible leer el archivo especificado.
fr: Impossible de lire le fichier sélectionné.
hu: Nem sikerült beolvasni a kiválasztott fájlt.
ko: 선택한 파일을 읽지 못했습니다.
pt_br: Não foi possível ler o arquivo selecionado.
pt_pt: Não foi possível ler o ficheiro selecionado.
uk: Не вдалося прочитати вибраний файл.
zh_hans: 无法读取选定的文件。

# ssh_key_import_error_unsupported_algorithm
source: Only RSA and Ed25519 SSH keys are supported.
ar: تُدعم فقط مفاتيح SSH من نوع RSA وEd25519.
de: Nur RSA und Ed25519 SSH-Schlüssel werden unterstützt.
es: Solo se admiten claves RSA y Ed25519 SSH.
fr: Seules les clés SSH RSA et Ed25519 sont prises en charge.
hu: Csak az RSA és Ed25519 SSH kulcsok támogatottak.
ko: RSA 및 Ed25519 SSH 키만 지원합니다.
pt_br: Somente chaves SSH RSA e Ed25519 são suportadas.
pt_pt: Apenas chaves SSH, RSA e Ed25519 são suportadas.
uk: Підтримуються лише SSH-ключі RSA та Ed25519.
zh_hans: 仅支持 RSA 和 Ed25519 SSH 密钥。

# ssh_key_import_error_unsupported_format
source: Unsupported SSH private key format.
ar: صيغة المفتاح الخاص SSH غير مدعومة.
de: Nicht unterstütztes SSH-Privatschlüsselformat.
es: Formato de clave privada SSH no soportado.
fr: Format de clé privée SSH non pris en charge.
hu: Nem támogatott SSH privát kulcs formátum.
ko: 지원하지 않는 SSH 개인 키 형식입니다.
pt_br: Formato de chave privada SSH não compatível.
pt_pt: Formato de chave privada SSH não suportado.
uk: Формат секретного SSH-ключа не підтримується.
zh_hans: 不支持的 SSH 私钥格式。

# ssh_key_import_failed_title
source: Failed to import SSH key
ar: فشل استيراد مفتاح SSH
de: SSH-Schlüssel konnte nicht importiert werden
es: Error al importar la clave SSH
fr: Échec de l'importation de la clé SSH
hu: Nem sikerült importálni az SSH kulcsot
ko: SSH 키를 가져오지 못했습니다.
pt_br: Falha ao importar a chave SSH
pt_pt: Falha ao importar chave SSH
uk: Не вдалося імпортувати SSH ключ
zh_hans: 导入 SSH 密钥失败

# ssh_key_import_passphrase_dialog_message
source: This %1$@ key is encrypted.
ar: هذا المفتاح %1$@ مشفّر.
de: Dieser %1$@-Schlüssel ist verschlüsselt.
es: Esta clave %1$@ está cifrada.
fr: Cette clé %1$@ est chiffrée.
hu: Ez a(z) %1$@ kulcs titkosított.
ko: 이 %1$@ 키는 암호화되어 있습니다.
pt_br: Esta %1$@ chave está criptografada.
pt_pt: Esta chave %1$@ é encriptada.
uk: Цей ключ формату %1$@ зашифровано.
zh_hans: 此 %1$@ 密钥已加密。

# ssh_key_import_passphrase_dialog_title
source: Enter SSH key passphrase
ar: أدخل عبارة مرور مفتاح SSH
de: Passphrase für SSH-Schlüssel eingeben
es: Introduzca contraseña de clave SSH
fr: Saisir la phrase de passe de la clé SSH
hu: Adja meg az SSH kulcs jelmondatát
ko: SSH 키 비밀 문구 입력
pt_br: Insira a frase secreta da chave SSH
pt_pt: Introduza a frase-palavra-passe da chave SSH
uk: Введіть ключову фразу SSH ключа
zh_hans: 输入 SSH 密钥口令
